app/views/tipo_comunicacoes/_form.html.erb

 						<%= builder.label :controle_privacidade_id %> <br />
						<%= builder.collection_select(:controle_privacidade_id, ControlePrivacidade.all, :id, :controle) %>
---
SELECT `controle_privacidades`.* FROM `controle_privacidades`