app/controllers/analise_privacidades_controller.rb

SELECT `analise_privacidades`.* FROM `analise_privacidades`
---
  def index
    @analise_privacidades = AnalisePrivacidade.all

INSERT INTO `analise_privacidades` (`rede_social`, `url_rede_social`, `descricao_analise`, `created_at`, `updated_at`) VALUES ('', '', '', '2016-03-18 11:23:48', '2016-03-18 11:23:48')
---
  def create
    @analise_privacidade = AnalisePrivacidade.new(analise_privacidade_params)





    respond_to do |format|
      if @analise_privacidade.save

UPDATE `analise_privacidades` SET `rede_social` = 'instagran', `url_rede_social` = 'instragran.com', `descricao_analise` = 'oia', `updated_at` = '2016-02-29 15:23:47' WHERE `analise_privacidades`.`id` = 3
---
  def update
    respond_to do |format|
      if @analise_privacidade.update(analise_privacidade_params)

DELETE FROM `analise_privacidades` WHERE `analise_privacidades`.`id` = 7
---
  def destroy
    @analise_privacidade.destroy

SELECT  `analise_privacidades`.* FROM `analise_privacidades` WHERE `analise_privacidades`.`id` = 7 LIMIT 1
---
    def set_analise_privacidade
      @analise_privacidade = AnalisePrivacidade.find(params[:id])