app/controllers/modelagem_privacidades_controller.rb

SELECT `modelagem_privacidades`.* FROM `modelagem_privacidades`
---
  def index
    @modelagem_privacidades = ModelagemPrivacidade.all